zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA1_TRIG16_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA1_TRIG17_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA1_TRIG18_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA1_TRIG19_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define ENC0_PHASEA_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define ENC0_PHASEB_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define ENC1_PHASEA_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define ENC1_PHASEB_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define EXTTRIG_IN7_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define FC3_RTS_SCL_SSEL1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 1) /* PIO0_21 */
#define FC7_CTS_SDA_SSEL0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 9) /* PIO0_21 */
#define FC7_SCK_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 7) /* PIO0_21 */
#define FLEXSPI0_SS0_N_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 6) /* PIO0_21 */
#define GPIO_PIO021_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define HS_SPI_SSEL3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 8) /* PIO0_21 */
#define PINT_PINT0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT4_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT5_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT6_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT_PINT7_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PIO0_21_PIO0_21_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PWM0_EXTA0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_EXTA1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_EXTA2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_EXTA3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_B1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 11) /* PIO0_21 */
#define PWM1_EXTA0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_EXTA1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_EXTA2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_EXTA3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 13) /* PIO0_21 */
#define SCT0_IN0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN2_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN4_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN5_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_IN6_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT0_OUT7_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 5) /* PIO0_21 */
#define SECGPIO_SECPIO021_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define SECPINT_SECPINT0_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define SECPINT_SECPINT1_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define UTICK0_CAPTURE3_PIO0_21 IOCON_MUX(21, IOCON_TYPE_D, 2) /* PIO0_21 */
#define ADC0_TRIG0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC0_TRIG1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC0_TRIG2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC0_TRIG3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC1_TRIG0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC1_TRIG1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC1_TRIG2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ADC1_TRIG3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER0_CAPTURE0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER0_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER0_CAPTURE2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER0_CAPTURE3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER1_CAPTURE0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER1_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER1_CAPTURE2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER1_CAPTURE3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER2_CAPTURE0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER2_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER2_CAPTURE2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER2_CAPTURE3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER3_CAPTURE0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER3_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER3_CAPTURE2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER3_CAPTURE3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER4_CAPTURE0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER4_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER4_CAPTURE2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER4_CAPTURE3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CT_INP15_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA0_TRIG00_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG010_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG011_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG012_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG013_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG014_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG015_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG016_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG017_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG018_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG019_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG01_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG020_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG021_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG022_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG023_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG024_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG025_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG026_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG027_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG028_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG029_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG02_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG030_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG031_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG032_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG033_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG034_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG035_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG036_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG037_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG038_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG039_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG03_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG040_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG041_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG042_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG043_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG044_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG045_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG046_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG047_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG048_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG049_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG04_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG050_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG051_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG05_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG06_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG07_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG08_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA0_TRIG09_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG10_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG11_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG12_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG13_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG14_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG15_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG16_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG17_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG18_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA1_TRIG19_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define ENC0_PHASEA_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define ENC0_PHASEB_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define ENC1_PHASEA_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define ENC1_PHASEB_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define EXTTRIG_IN5_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define FC6_TXD_SCL_MISO_WS_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 1) /* PIO0_22 */
#define FC7_RTS_SCL_SSEL1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 9) /* PIO0_22 */
#define FLEXSPI0_SCLK_N_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 5) /* PIO0_22 */
#define FLEXSPI0_SS1_N_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 6) /* PIO0_22 */
#define GPIO_PIO022_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT4_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT5_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT6_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT_PINT7_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PIO0_22_PIO0_22_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PWM0_EXTA0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_EXTA1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_EXTA2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_EXTA3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_EXTA0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_EXTA1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_EXTA2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_EXTA3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 13) /* PIO0_22 */
#define PWM1_X0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 11) /* PIO0_22 */
#define SCT0_OUT3_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 4) /* PIO0_22 */
#define SECGPIO_SECPIO022_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define SECPINT_SECPINT0_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define SECPINT_SECPINT1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define USB0_VBUS_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 7) /* PIO0_22 */
#define UTICK0_CAPTURE1_PIO0_22 IOCON_MUX(22, IOCON_TYPE_D, 2) /* PIO0_22 */
#define ADC0_CH8B_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC0_TRIG0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC0_TRIG1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC0_TRIG2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC0_TRIG3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC1_TRIG0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC1_TRIG1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC1_TRIG2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define ADC1_TRIG3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define CTIMER1_MATCH2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 2) /* PIO0_23 */
#define CTIMER3_MATCH3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 3) /* PIO0_23 */
#define DMA0_TRIG00_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG010_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG011_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG012_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG013_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG014_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG015_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG016_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG017_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG018_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG019_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG01_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG020_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG021_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG022_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG023_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG024_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG025_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG026_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG027_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG028_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG029_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG02_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG030_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG031_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG032_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG033_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG034_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG035_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG036_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG037_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG038_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG039_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG03_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG040_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG041_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG042_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG043_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG044_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG045_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG046_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG047_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG048_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG049_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG04_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG050_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG051_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG05_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG06_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG07_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG08_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA0_TRIG09_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG10_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG11_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG12_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG13_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG14_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG15_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG16_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG17_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG18_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define DMA1_TRIG19_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define FC0_CTS_SDA_SSEL0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 5) /* PIO0_23 */
#define GPIO_PIO023_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define MCLK_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 1) /* PIO0_23 */
#define PINT_PINT0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT2_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT3_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT4_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT5_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT6_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PINT_PINT7_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define PIO0_23_PIO0_23_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 0) /* PIO0_23 */
#define SCT0_OUT4_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 4) /* PIO0_23 */
#define SECGPIO_SECPIO023_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 10) /* PIO0_23 */
#define SECPINT_SECPINT0_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 10) /* PIO0_23 */
#define SECPINT_SECPINT1_PIO0_23 IOCON_MUX(23, IOCON_TYPE_D, 10) /* PIO0_23 */
#define ADC0_TRIG0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC0_TRIG1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC0_TRIG2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC0_TRIG3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC1_TRIG0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC1_TRIG1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC1_TRIG2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define ADC1_TRIG3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER0_CAPTURE0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER0_CAPTURE1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER0_CAPTURE2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER0_CAPTURE3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER1_CAPTURE0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER1_CAPTURE1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER1_CAPTURE2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER1_CAPTURE3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER2_CAPTURE0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER2_CAPTURE1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER2_CAPTURE2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER2_CAPTURE3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER3_CAPTURE0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER3_CAPTURE1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER3_CAPTURE2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER3_CAPTURE3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER4_CAPTURE0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER4_CAPTURE1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER4_CAPTURE2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
