zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define CTIMER4_CAPTURE3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CT_INP8_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA0_TRIG00_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG010_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG011_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG012_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG013_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG014_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG015_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG016_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG017_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG018_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG019_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG01_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG020_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG021_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG022_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG023_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG024_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG025_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG026_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG027_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG028_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG029_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG02_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG030_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG031_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG032_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG033_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG034_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG035_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG036_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG037_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG038_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG039_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG03_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG040_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG041_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG042_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG043_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG044_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG045_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG046_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG047_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG048_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG049_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG04_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG050_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG051_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG05_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG06_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG07_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG08_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA0_TRIG09_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG10_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG11_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG12_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG13_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG14_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG15_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG16_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG17_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG18_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA1_TRIG19_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define FC0_RXD_SDA_MOSI_DATA_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 1) /* PIO0_24 */
#define GPIO_PIO024_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define HSCMP0_IN0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define I3C0_SDA_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 5) /* PIO0_24 */
#define PINT_PINT0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT4_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT5_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT6_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT_PINT7_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PIO0_24_PIO0_24_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PWM0_A1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 11) /* PIO0_24 */
#define PWM0_X0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 13) /* PIO0_24 */
#define SCT0_IN0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN2_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN3_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN4_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN5_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT0_IN6_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SECGPIO_SECPIO024_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define SECPINT_SECPINT0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define SECPINT_SECPINT1_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define SPI_CS0_DIS_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 12) /* PIO0_24 */
#define SWD_TRACEDATA0_PIO0_24 IOCON_MUX(24, IOCON_TYPE_D, 6) /* PIO0_24 */
#define ADC0_TRIG0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC0_TRIG1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC0_TRIG2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC0_TRIG3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC1_TRIG0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC1_TRIG1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC1_TRIG2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ADC1_TRIG3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER0_CAPTURE0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER0_CAPTURE1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER0_CAPTURE2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER0_CAPTURE3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER1_CAPTURE0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER1_CAPTURE1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER1_CAPTURE2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER1_CAPTURE3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER2_CAPTURE0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER2_CAPTURE1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER2_CAPTURE2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER2_CAPTURE3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER3_CAPTURE0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER3_CAPTURE1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER3_CAPTURE2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER3_CAPTURE3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER4_CAPTURE0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER4_CAPTURE1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER4_CAPTURE2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER4_CAPTURE3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CT_INP9_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA0_TRIG00_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG010_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG011_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG012_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG013_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG014_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG015_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG016_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG017_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG018_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG019_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG01_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG020_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG021_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG022_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG023_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG024_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG025_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG026_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG027_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG028_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG029_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG02_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG030_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG031_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG032_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG033_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG034_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG035_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG036_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG037_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG038_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG039_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG03_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG040_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG041_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG042_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG043_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG044_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG045_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG046_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG047_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG048_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG049_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG04_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG050_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG051_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG05_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG06_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG07_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG08_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA0_TRIG09_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG10_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG11_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG12_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG13_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG14_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG15_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG16_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG17_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG18_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA1_TRIG19_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define ENC0_PHASEA_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define ENC0_PHASEB_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define ENC1_PHASEA_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define ENC1_PHASEB_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define EXTTRIG_IN6_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define FC0_TXD_SCL_MISO_WS_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 1) /* PIO0_25 */
#define FLEXSPI0_DQS_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 6) /* PIO0_25 */
#define GPIO_PIO025_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define HSCMP0_OUT_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 7) /* PIO0_25 */
#define PINT_PINT0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT4_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT5_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT6_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT_PINT7_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PIO0_25_PIO0_25_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PWM0_A0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 11) /* PIO0_25 */
#define PWM0_EXTA0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_EXTA1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_EXTA2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_EXTA3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_EXTA0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_EXTA1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_EXTA2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_EXTA3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 13) /* PIO0_25 */
#define SCT0_IN0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN2_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN3_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN4_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN5_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT0_IN6_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SECGPIO_SECPIO025_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define SECPINT_SECPINT0_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define SECPINT_SECPINT1_PIO0_25 IOCON_MUX(25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define ADC0_TRIG0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC0_TRIG1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC0_TRIG2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC0_TRIG3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC1_TRIG0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC1_TRIG1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC1_TRIG2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define ADC1_TRIG3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CLKOUT_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 2) /* PIO0_26 */
#define CTIMER0_CAPTURE0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER0_CAPTURE1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER0_CAPTURE2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER0_CAPTURE3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER1_CAPTURE0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER1_CAPTURE1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER1_CAPTURE2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER1_CAPTURE3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER2_CAPTURE0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER2_CAPTURE1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER2_CAPTURE2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER2_CAPTURE3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER3_CAPTURE0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER3_CAPTURE1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER3_CAPTURE2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER3_CAPTURE3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER4_CAPTURE0_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER4_CAPTURE1_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER4_CAPTURE2_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER4_CAPTURE3_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CT_INP14_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA0_TRIG00_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG010_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG011_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG012_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG013_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG014_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG015_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG016_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG017_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG018_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG019_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG01_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG020_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG021_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG022_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG023_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG024_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG025_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG026_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG027_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG028_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG029_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG02_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG030_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG031_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG032_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG033_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG034_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG035_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG036_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG037_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG038_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG039_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG03_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG040_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG041_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG042_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG043_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG044_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG045_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG046_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG047_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG048_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG049_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG04_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG050_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG051_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG05_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG06_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG07_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG08_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA0_TRIG09_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA1_TRIG10_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA1_TRIG11_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA1_TRIG12_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA1_TRIG13_PIO0_26 IOCON_MUX(26, IOCON_TYPE_D, 0) /* PIO0_26 */
