zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA0_TRIG018_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG019_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG01_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG020_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG021_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG022_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG023_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG024_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG025_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG026_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG027_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG028_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG029_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG02_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG030_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG031_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG032_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG033_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG034_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG035_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG036_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG037_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG038_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG039_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG03_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG040_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG041_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG042_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG043_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG044_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG045_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG046_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG047_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG048_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG049_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG04_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG050_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG051_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG05_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG06_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG07_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG08_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA0_TRIG09_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG10_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG11_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG12_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG13_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG14_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG15_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG16_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG17_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG18_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA1_TRIG19_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define ENC0_PHASEA_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define ENC0_PHASEB_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define ENC1_PHASEA_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define ENC1_PHASEB_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define EXTTRIG_IN8_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define FC0_SCK_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 1) /* PIO1_4 */
#define FC4_TXD_SCL_MISO_WS_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 7) /* PIO1_4 */
#define GPIO_PIO14_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT4_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT5_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT6_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT_PINT7_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PIO1_4_PIO1_4_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PWM0_B2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 11) /* PIO1_4 */
#define PWM0_EXTA0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_EXTA1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_EXTA2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_EXTA3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_EXTA0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_EXTA1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_EXTA2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_EXTA3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 13) /* PIO1_4 */
#define SCT0_OUT0_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 4) /* PIO1_4 */
#define SPI_DIN_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 10) /* PIO1_4 */
#define SYSCON_FREQMEA_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 5) /* PIO1_4 */
#define ADC0_TRIG0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC0_TRIG1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC0_TRIG2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC0_TRIG3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC1_TRIG0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC1_TRIG1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC1_TRIG2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define ADC1_TRIG3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define AOI0_TRIGOUT0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 12) /* PIO1_5 */
#define AOI1_TRIGOUT0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 12) /* PIO1_5 */
#define CTIMER2_MATCH0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 3) /* PIO1_5 */
#define DMA0_TRIG00_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG010_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG011_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG012_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG013_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG014_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG015_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG016_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG017_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG018_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG019_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG01_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG020_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG021_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG022_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG023_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG024_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG025_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG026_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG027_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG028_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG029_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG02_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG030_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG031_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG032_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG033_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG034_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG035_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG036_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG037_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG038_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG039_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG03_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG040_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG041_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG042_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG043_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG044_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG045_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG046_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG047_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG048_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG049_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG04_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG050_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG051_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG05_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG06_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG07_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG08_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA0_TRIG09_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG10_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG11_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG12_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG13_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG14_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG15_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG16_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG17_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG18_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA1_TRIG19_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define FC0_RXD_SDA_MOSI_DATA_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 1) /* PIO1_5 */
#define GPIO_PIO15_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define HSCMP0_IN3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT4_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT5_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT6_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT_PINT7_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PIO1_5_PIO1_5_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PWM1_A3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 11) /* PIO1_5 */
#define SCT0_IN0_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN1_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN2_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN3_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN4_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN5_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT0_IN6_PIO1_5 IOCON_MUX(37, IOCON_TYPE_D, 4) /* PIO1_5 */
#define ADC0_TRIG0_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC0_TRIG1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC0_TRIG2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC0_TRIG3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC1_TRIG0_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC1_TRIG1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC1_TRIG2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define ADC1_TRIG3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define AOI0_TRIGOUT5_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 12) /* PIO1_6 */
#define AOI1_TRIGOUT5_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 12) /* PIO1_6 */
#define CTIMER2_MATCH1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 3) /* PIO1_6 */
#define DMA0_TRIG00_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG010_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG011_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG012_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG013_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG014_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG015_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG016_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG017_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG018_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG019_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG01_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG020_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG021_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG022_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG023_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG024_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG025_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG026_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG027_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG028_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG029_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG02_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG030_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG031_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG032_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG033_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG034_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG035_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG036_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG037_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG038_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG039_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG03_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG040_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG041_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG042_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG043_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG044_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG045_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG046_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG047_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG048_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG049_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG04_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG050_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG051_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG05_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG06_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG07_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG08_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA0_TRIG09_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG10_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG11_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG12_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG13_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG14_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG15_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG16_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG17_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG18_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA1_TRIG19_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define FC0_TXD_SCL_MISO_WS_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 1) /* PIO1_6 */
#define GPIO_PIO16_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define HSCMP0_OUT_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 13) /* PIO1_6 */
#define PINT_PINT0_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT4_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT5_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT6_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT_PINT7_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PIO1_6_PIO1_6_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PWM0_A1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 11) /* PIO1_6 */
#define SCT0_IN0_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN1_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN2_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN3_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN4_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN5_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT0_IN6_PIO1_6 IOCON_MUX(38, IOCON_TYPE_D, 4) /* PIO1_6 */
#define ADC0_TRIG0_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC0_TRIG1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC0_TRIG2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC0_TRIG3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC1_CH3B_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC1_TRIG0_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC1_TRIG1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC1_TRIG2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define ADC1_TRIG3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define AOI1_OUT3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 12) /* PIO1_7 */
#define CTIMER2_MATCH2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 3) /* PIO1_7 */
#define DMA0_TRIG00_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG010_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG011_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG012_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG013_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG014_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG015_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG016_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG017_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG018_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG019_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG01_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG020_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG021_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG022_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG023_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG024_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG025_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG026_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG027_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG028_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG029_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG02_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG030_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG031_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG032_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG033_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG034_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG035_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG036_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG037_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG038_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG039_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG03_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG040_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG041_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG042_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG043_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
