zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA0_TRIG044_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG045_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG046_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG047_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG048_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG049_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG04_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG050_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG051_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG05_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG06_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG07_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG08_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA0_TRIG09_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG10_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG11_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG12_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG13_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG14_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG15_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG16_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG17_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG18_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA1_TRIG19_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define FC0_RTS_SCL_SSEL1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 1) /* PIO1_7 */
#define GPIO_PIO17_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT0_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT4_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT5_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT6_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT_PINT7_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PIO1_7_PIO1_7_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT0_IN0_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN1_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN2_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN3_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN4_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN5_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT0_IN6_PIO1_7 IOCON_MUX(39, IOCON_TYPE_D, 4) /* PIO1_7 */
#define ADC0_TRIG0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC0_TRIG1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC0_TRIG2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC0_TRIG3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC1_TRIG0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC1_TRIG1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC1_TRIG2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC1_TRIG3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define AOI0_TRIGOUT6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 13) /* PIO1_8 */
#define AOI1_OUT2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 12) /* PIO1_8 */
#define AOI1_TRIGOUT6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 13) /* PIO1_8 */
#define DMA0_TRIG00_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG010_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG011_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG012_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG013_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG014_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG015_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG016_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG017_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG018_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG019_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG01_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG020_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG021_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG022_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG023_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG024_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG025_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG026_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG027_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG028_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG029_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG02_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG030_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG031_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG032_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG033_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG034_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG035_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG036_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG037_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG038_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG039_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG03_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG040_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG041_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG042_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG043_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG044_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG045_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG046_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG047_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG048_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG049_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG04_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG050_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG051_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG05_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG06_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG07_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG08_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG09_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG10_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG11_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG12_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG13_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG14_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG15_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG16_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG17_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA1_TRIG19_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define FC0_CTS_SDA_SSEL0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 1) /* PIO1_8 */
#define FC1_SCK_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 7) /* PIO1_8 */
#define FC4_SSEL2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 5) /* PIO1_8 */
#define GPIO_PIO18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT4_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT5_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT7_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PIO1_8_PIO1_8_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PWM0_A2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 11) /* PIO1_8 */
#define SCT0_OUT1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 4) /* PIO1_8 */
#define ADC0_CH0A_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC1_TRIG0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC1_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC1_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC1_TRIG3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define AOI1_OUT3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 12) /* PIO1_9 */
#define CTIMER0_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER0_CAPTURE1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER0_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER0_CAPTURE3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER1_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER1_CAPTURE1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER1_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER1_CAPTURE3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER2_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER2_CAPTURE1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER2_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER2_CAPTURE3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER3_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER3_CAPTURE1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER3_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER3_CAPTURE3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER4_CAPTURE0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER4_CAPTURE1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER4_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CTIMER4_CAPTURE3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define CT_INP4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define DMA0_TRIG00_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG010_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG011_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG012_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG013_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG014_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG015_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG016_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG017_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG018_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG019_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG01_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG020_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG021_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG022_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG023_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG024_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG025_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG026_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG027_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG028_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG029_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG02_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG030_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG031_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG032_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG033_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG034_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG035_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG036_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG037_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG038_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG039_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG03_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG040_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG041_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG042_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG043_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG044_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG045_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG046_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG047_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG048_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG049_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG04_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG050_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG051_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG05_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG06_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG07_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG08_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG09_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG10_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG11_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG12_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG13_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG14_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG15_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG16_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG17_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG18_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA1_TRIG19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define FC1_SCK_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 2) /* PIO1_9 */
#define FC4_CTS_SDA_SSEL0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 5) /* PIO1_9 */
#define GPIO_PIO19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define HSCMP0_IN4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define OPAMP0_OUT_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PIO1_9_PIO1_9_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define SCT0_OUT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 4) /* PIO1_9 */
#define ADC0_TRIG0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC0_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC0_TRIG3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC1_TRIG0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC1_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC1_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC1_TRIG3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define AOI0_TRIGOUT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 12) /* PIO1_10 */
#define AOI1_TRIGOUT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 12) /* PIO1_10 */
#define CTIMER1_MATCH0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 3) /* PIO1_10 */
#define DMA0_TRIG00_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG010_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG011_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG012_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG013_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG014_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG015_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG016_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG017_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG018_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG019_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG01_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG020_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG021_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG022_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG023_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG024_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG025_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG026_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG027_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG028_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG029_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG02_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG030_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG031_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG032_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG033_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG034_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG035_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG036_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG037_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG038_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG039_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG03_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG040_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG041_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG042_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG043_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG044_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG045_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG046_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG047_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG048_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG049_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG04_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG050_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG051_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG05_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG06_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG07_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG08_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG09_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG10_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG11_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG12_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG13_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG14_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG15_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG16_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG17_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG18_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA1_TRIG19_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define FC1_RXD_SDA_MOSI_DATA_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 2) /* PIO1_10 */
#define GPIO_PIO110_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define HSCMP1_IN3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define HSCMP2_OUT_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 13) /* PIO1_10 */
#define PINT_PINT0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PIO1_10_PIO1_10_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PWM0_X1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 11) /* PIO1_10 */
#define SCT0_OUT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 4) /* PIO1_10 */
#define ADC0_TRIG0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC0_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC0_TRIG3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC1_TRIG0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC1_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC1_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
