zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA0_TRIG048_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG049_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG04_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG050_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG051_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG05_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG06_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG07_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG08_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG09_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG10_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG11_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG12_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG13_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG14_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG15_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG16_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG17_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG18_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA1_TRIG19_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define FC6_RXD_SDA_MOSI_DATA_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 2) /* PIO1_13 */
#define GPIO_PIO113_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PIO1_13_PIO1_13_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PWM1_X1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 11) /* PIO1_13 */
#define QSPI_DIN2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 10) /* PIO1_13 */
#define SCT0_OUT8_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 8) /* PIO1_13 */
#define USB0_FRAME_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 5) /* PIO1_13 */
#define USB0_OVERCURRENTN_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 4) /* PIO1_13 */
#define ADC0_TRIG0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC0_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC0_TRIG3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC1_TRIG0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC1_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC1_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC1_TRIG3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define CTIMER1_MATCH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 3) /* PIO1_14 */
#define DMA0_TRIG00_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG010_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG011_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG012_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG013_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG014_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG015_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG016_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG017_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG018_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG019_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG01_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG020_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG021_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG022_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG023_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG024_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG025_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG026_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG027_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG028_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG029_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG02_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG030_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG031_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG032_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG033_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG034_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG035_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG036_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG037_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG038_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG039_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG03_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG040_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG041_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG042_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG043_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG044_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG045_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG046_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG047_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG048_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG049_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG04_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG050_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG051_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG05_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG06_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG07_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG08_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG09_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG10_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG11_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG12_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG13_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG14_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG15_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG16_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG17_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG18_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA1_TRIG19_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ENC0_PHASEA_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define ENC0_PHASEB_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define ENC1_PHASEA_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define ENC1_PHASEB_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define EXTTRIG_IN9_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define FC5_CTS_SDA_SSEL0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 4) /* PIO1_14 */
#define GPIO_PIO114_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PIO1_14_PIO1_14_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PMC_ACMP_IN4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PWM0_B3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 11) /* PIO1_14 */
#define PWM0_EXTA0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_EXTA1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_EXTA2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_EXTA3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_EXTA0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_EXTA1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_EXTA2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_EXTA3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 13) /* PIO1_14 */
#define QSPI_DIN0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 12) /* PIO1_14 */
#define USB0_LEDN_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 5) /* PIO1_14 */
#define UTICK0_CAPTURE2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 2) /* PIO1_14 */
#define ADC0_TRIG0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC0_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC0_TRIG3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC1_TRIG0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC1_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC1_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC1_TRIG3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER0_CAPTURE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER0_CAPTURE1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER0_CAPTURE2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER0_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER1_CAPTURE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER1_CAPTURE1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER1_CAPTURE2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER1_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER2_CAPTURE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER2_CAPTURE1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER2_CAPTURE2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER2_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER3_CAPTURE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER3_CAPTURE1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER3_CAPTURE2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER3_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER4_CAPTURE0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER4_CAPTURE1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER4_CAPTURE2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER4_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CT_INP7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA0_TRIG00_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG010_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG011_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG012_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG013_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG014_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG015_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG016_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG017_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG018_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG019_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG01_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG020_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG021_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG022_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG023_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG024_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG025_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG026_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG027_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG028_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG029_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG02_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG030_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG031_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG032_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG033_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG034_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG035_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG036_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG037_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG038_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG039_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG03_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG040_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG041_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG042_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG043_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG044_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG045_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG046_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG047_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG048_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG049_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG04_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG050_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG051_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG05_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG06_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG07_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG08_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG09_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG10_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG11_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG12_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG13_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG14_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG15_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG16_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG17_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG18_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA1_TRIG19_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ENC0_PHASEA_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define ENC0_PHASEB_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define ENC1_PHASEA_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define ENC1_PHASEB_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define EXTTRIG_IN8_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define FC1_SCK_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 9) /* PIO1_15 */
#define FC4_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 5) /* PIO1_15 */
#define FC5_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 4) /* PIO1_15 */
#define FLEXSPI0_DATA5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 8) /* PIO1_15 */
#define GPIO_PIO115_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PIO1_15_PIO1_15_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PWM0_B0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 11) /* PIO1_15 */
#define PWM0_EXTA0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_EXTA1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_EXTA2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_EXTA3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_EXTA0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_EXTA1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_EXTA2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_EXTA3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 13) /* PIO1_15 */
#define QSPI_CS0_DIS_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 10) /* PIO1_15 */
#define UTICK0_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 2) /* PIO1_15 */
#define ADC0_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC1_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC1_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC1_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC1_TRIG3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define CTIMER1_MATCH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 3) /* PIO1_16 */
#define DMA0_TRIG00_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG010_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG011_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG012_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG013_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG014_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG015_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG016_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG017_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG018_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG019_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG01_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG020_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG021_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG022_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG023_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG024_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG025_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG026_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG027_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG028_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG029_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
