zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA0_TRIG02_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG030_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG031_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG032_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG033_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG034_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG035_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG036_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG037_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG038_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG039_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG03_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG040_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG041_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG042_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG043_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG044_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG045_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG046_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG047_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG048_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG049_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG04_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG050_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG051_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG05_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG06_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG07_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG08_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG09_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG10_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG11_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG12_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG13_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG14_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG15_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG16_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG17_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG18_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA1_TRIG19_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ENC0_PHASEA_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define ENC0_PHASEB_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define ENC1_PHASEA_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define ENC1_PHASEB_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define EXTTRIG_IN7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define FC1_RXD_SDA_MOSI_DATA_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 9) /* PIO1_16 */
#define FC6_TXD_SCL_MISO_WS_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 2) /* PIO1_16 */
#define FLEXSPI0_DATA4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 8) /* PIO1_16 */
#define GPIO_PIO116_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PIO1_16_PIO1_16_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PWM0_B2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 11) /* PIO1_16 */
#define PWM0_EXTA0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_EXTA1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_EXTA2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_EXTA3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_EXTA0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_EXTA1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_EXTA2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_EXTA3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 13) /* PIO1_16 */
#define QSPI_CS1_DIS_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 10) /* PIO1_16 */
#define ADC0_TRIG0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC0_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC0_TRIG3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC1_TRIG0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC1_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC1_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC1_TRIG3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define AOI1_OUT3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 12) /* PIO1_17 */
#define DMA0_TRIG00_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG010_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG011_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG012_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG013_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG014_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG015_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG016_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG017_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG018_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG019_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG01_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG020_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG021_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG022_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG023_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG024_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG025_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG026_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG027_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG028_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG029_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG02_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG030_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG031_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG032_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG033_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG034_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG035_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG036_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG037_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG038_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG039_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG03_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG040_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG041_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG042_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG043_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG044_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG045_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG046_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG047_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG048_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG049_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG04_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG050_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG051_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG05_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG06_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG07_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG08_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG09_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG10_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG11_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG12_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG13_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG14_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG15_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG16_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG17_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG18_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA1_TRIG19_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define FC6_RTS_SCL_SSEL1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 3) /* PIO1_17 */
#define GPIO_PIO117_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PIO1_17_PIO1_17_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PWM0_B0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 11) /* PIO1_17 */
#define SCT0_OUT4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 4) /* PIO1_17 */
#define ADC0_TRIG0_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC0_TRIG1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC0_TRIG2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC0_TRIG3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC1_TRIG0_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC1_TRIG1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC1_TRIG2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define ADC1_TRIG3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG00_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG010_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG011_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG012_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG013_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG014_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG015_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG016_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG017_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG018_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG019_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG01_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG020_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG021_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG022_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG023_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG024_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG025_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG026_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG027_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG028_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG029_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG02_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG030_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG031_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG032_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG033_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG034_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG035_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG036_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG037_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG038_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG039_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG03_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG040_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG041_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG042_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG043_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG044_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG045_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG046_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG047_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG048_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG049_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG04_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG050_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG051_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG05_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG06_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG07_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG08_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA0_TRIG09_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG10_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG11_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG12_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG13_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG14_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG15_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG16_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG17_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG18_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA1_TRIG19_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define GPIO_PIO118_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define HSCMP2_OUT_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 13) /* PIO1_18 */
#define PINT_PINT0_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT1_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT4_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT5_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT6_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT_PINT7_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PIO1_18_PIO1_18_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PWM0_A2_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 11) /* PIO1_18 */
#define QSPI_DIN3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 12) /* PIO1_18 */
#define RTC_ALARMOUT_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 8) /* PIO1_18 */
#define RTC_TAMPER3_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 0) /* PIO1_18 */
#define SCT0_OUT5_PIO1_18 IOCON_MUX(50, IOCON_TYPE_D, 4) /* PIO1_18 */
#define ADC0_CH4B_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC0_TRIG0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC0_TRIG1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC0_TRIG2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC0_TRIG3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC1_TRIG0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC1_TRIG1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC1_TRIG2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define ADC1_TRIG3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define AOI1_OUT2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 13) /* PIO1_19 */
#define CTIMER3_MATCH1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 3) /* PIO1_19 */
#define DAC1_OUT_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG00_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG010_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG011_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG012_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG013_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG014_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG015_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG016_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG017_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG018_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG019_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG01_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG020_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG021_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG022_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG023_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG024_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG025_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG026_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG027_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG028_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG029_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG02_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG030_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG031_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG032_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG033_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG034_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG035_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG036_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG037_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG038_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG039_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG03_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG040_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG041_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG042_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG043_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG044_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG045_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG046_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG047_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG048_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG049_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG04_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG050_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG051_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG05_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG06_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG07_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG08_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA0_TRIG09_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG10_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG11_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG12_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG13_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG14_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG15_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
