zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA1_TRIG16_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG17_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG18_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define DMA1_TRIG19_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define FC4_SCK_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 5) /* PIO1_19 */
#define GPIO_PIO119_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define HSCMP1_IN5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT4_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT6_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PINT_PINT7_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define PIO1_19_PIO1_19_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 0) /* PIO1_19 */
#define QSPI_DIN0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 10) /* PIO1_19 */
#define SCT0_IN0_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN1_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN2_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN3_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN4_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN5_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_IN6_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 4) /* PIO1_19 */
#define SCT0_OUT7_PIO1_19 IOCON_MUX(51, IOCON_TYPE_D, 2) /* PIO1_19 */
#define ADC0_TRIG0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC0_TRIG1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC0_TRIG2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC0_TRIG3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC1_CH8A_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC1_TRIG0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC1_TRIG1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC1_TRIG2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define ADC1_TRIG3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define AOI0_OUT1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 12) /* PIO1_20 */
#define CTIMER0_CAPTURE0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER0_CAPTURE1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER0_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER0_CAPTURE3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER1_CAPTURE0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER1_CAPTURE1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER1_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER1_CAPTURE3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER2_CAPTURE0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER2_CAPTURE1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER2_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER2_CAPTURE3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER3_CAPTURE0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER3_CAPTURE1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER3_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER3_CAPTURE3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER4_CAPTURE0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER4_CAPTURE1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER4_CAPTURE2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER4_CAPTURE3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CT_INP14_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA0_TRIG00_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG010_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG011_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG012_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG013_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG014_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG015_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG016_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG017_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG018_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG019_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG01_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG020_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG021_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG022_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG023_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG024_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG025_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG026_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG027_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG028_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG029_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG02_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG030_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG031_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG032_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG033_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG034_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG035_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG036_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG037_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG038_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG039_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG03_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG040_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG041_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG042_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG043_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG044_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG045_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG046_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG047_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG048_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG049_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG04_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG050_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG051_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG05_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG06_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG07_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG08_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA0_TRIG09_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG10_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG11_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG12_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG13_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG14_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG15_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG16_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG17_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG18_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA1_TRIG19_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define FC4_TXD_SCL_MISO_WS_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 5) /* PIO1_20 */
#define FC7_RTS_SCL_SSEL1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 1) /* PIO1_20 */
#define GPIO_PIO120_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT1_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT2_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT3_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT4_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT5_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT6_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT_PINT7_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PIO1_20_PIO1_20_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PWM0_A0_PIO1_20 IOCON_MUX(52, IOCON_TYPE_D, 11) /* PIO1_20 */
#define ADC0_TRIG0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC0_TRIG1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC0_TRIG2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC0_TRIG3_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC1_TRIG0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC1_TRIG1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC1_TRIG2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define ADC1_TRIG3_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define AOI0_TRIGOUT1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 12) /* PIO1_21 */
#define AOI1_TRIGOUT1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 12) /* PIO1_21 */
#define CTIMER3_MATCH2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 3) /* PIO1_21 */
#define DMA0_TRIG00_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG010_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG011_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG012_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG013_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG014_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG015_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG016_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG017_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG018_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG019_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG01_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG020_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG021_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG022_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG023_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG024_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG025_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG026_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG027_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG028_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG029_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG02_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG030_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG031_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG032_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG033_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG034_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG035_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG036_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG037_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG038_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG039_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG03_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG040_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG041_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG042_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG043_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG044_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG045_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG046_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG047_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG048_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG049_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG04_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG050_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG051_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG05_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG06_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG07_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG08_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA0_TRIG09_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG10_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG11_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG12_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG13_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG14_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG15_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG16_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG17_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG18_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA1_TRIG19_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define FC4_RXD_SDA_MOSI_DATA_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 5) /* PIO1_21 */
#define FC7_CTS_SDA_SSEL0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 1) /* PIO1_21 */
#define GPIO_PIO121_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT1_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT2_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT3_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT4_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT5_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT6_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT_PINT7_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PIO1_21_PIO1_21_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PWM1_A0_PIO1_21 IOCON_MUX(53, IOCON_TYPE_D, 11) /* PIO1_21 */
#define ADC0_TRIG0_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC0_TRIG1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC0_TRIG2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC0_TRIG3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC1_TRIG0_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC1_TRIG1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC1_TRIG2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define ADC1_TRIG3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define AOI0_TRIGOUT2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 12) /* PIO1_22 */
#define AOI1_TRIGOUT2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 12) /* PIO1_22 */
#define CAN0_RD_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 9) /* PIO1_22 */
#define CTIMER2_MATCH3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 3) /* PIO1_22 */
#define DAC0_OUT_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG00_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG010_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG011_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG012_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG013_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG014_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG015_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG016_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG017_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG018_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG019_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG01_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG020_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG021_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG022_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG023_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG024_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG025_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG026_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG027_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG028_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG029_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG02_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG030_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG031_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG032_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG033_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG034_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG035_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG036_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG037_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG038_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG039_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG03_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG040_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG041_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG042_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG043_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG044_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG045_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG046_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG047_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG048_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG049_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG04_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG050_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG051_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG05_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG06_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG07_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG08_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA0_TRIG09_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG10_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG11_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG12_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG13_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG14_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG15_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG16_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG17_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG18_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA1_TRIG19_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define FC4_SSEL3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 5) /* PIO1_22 */
#define GPIO_PIO122_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define HSCMP1_IN1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT0_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT4_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT5_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT6_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT_PINT7_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PIO1_22_PIO1_22_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PWM0_B1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 11) /* PIO1_22 */
#define QSPI_DIN3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 10) /* PIO1_22 */
#define SCT0_IN0_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN1_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN2_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN3_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN4_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN5_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define SCT0_IN6_PIO1_22 IOCON_MUX(54, IOCON_TYPE_D, 4) /* PIO1_22 */
#define ADC0_TRIG0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC0_TRIG1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC0_TRIG2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC0_TRIG3_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC1_TRIG0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC1_TRIG1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC1_TRIG2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define ADC1_TRIG3_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define AOI0_TRIGOUT4_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 12) /* PIO1_23 */
#define AOI1_TRIGOUT4_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 12) /* PIO1_23 */
#define DMA0_TRIG00_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG010_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG011_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
