zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define DMA0_TRIG012_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG013_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG014_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG015_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG016_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG017_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG018_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG019_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG01_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG020_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG021_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG022_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG023_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG024_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG025_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG026_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG027_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG028_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG029_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG02_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG030_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG031_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG032_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG033_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG034_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG035_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG036_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG037_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG038_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG039_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG03_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG040_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG041_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG042_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG043_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG044_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG045_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG046_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG047_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG048_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG049_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG04_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG050_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG051_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG05_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG06_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG07_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG08_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA0_TRIG09_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG10_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG11_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG12_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG13_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG14_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG15_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG16_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG17_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG18_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA1_TRIG19_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define FC2_SCK_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 1) /* PIO1_23 */
#define FC3_SSEL2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 5) /* PIO1_23 */
#define GPIO_PIO123_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define HSCMP2_IN1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT2_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT3_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT4_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT5_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT6_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT_PINT7_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PIO1_23_PIO1_23_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PWM1_A1_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 11) /* PIO1_23 */
#define SCT0_OUT0_PIO1_23 IOCON_MUX(55, IOCON_TYPE_D, 2) /* PIO1_23 */
#define ADC0_TRIG0_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC0_TRIG1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC0_TRIG2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC0_TRIG3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC1_CH8B_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC1_TRIG0_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC1_TRIG1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC1_TRIG2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define ADC1_TRIG3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define AOI0_OUT2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 12) /* PIO1_24 */
#define DMA0_TRIG00_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG010_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG011_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG012_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG013_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG014_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG015_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG016_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG017_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG018_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG019_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG01_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG020_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG021_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG022_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG023_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG024_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG025_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG026_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG027_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG028_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG029_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG02_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG030_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG031_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG032_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG033_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG034_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG035_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG036_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG037_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG038_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG039_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG03_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG040_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG041_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG042_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG043_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG044_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG045_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG046_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG047_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG048_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG049_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG04_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG050_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG051_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG05_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG06_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG07_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG08_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA0_TRIG09_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG10_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG11_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG12_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG13_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG14_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG15_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG16_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG17_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG18_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA1_TRIG19_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define FC2_RXD_SDA_MOSI_DATA_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 1) /* PIO1_24 */
#define FC3_SSEL3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 5) /* PIO1_24 */
#define GPIO_PIO124_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT0_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT2_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT3_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT4_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT5_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT6_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT_PINT7_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PIO1_24_PIO1_24_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 0) /* PIO1_24 */
#define SCT0_OUT1_PIO1_24 IOCON_MUX(56, IOCON_TYPE_D, 2) /* PIO1_24 */
#define ADC0_TRIG0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC0_TRIG1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC0_TRIG2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC0_TRIG3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC1_TRIG0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC1_TRIG1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC1_TRIG2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define ADC1_TRIG3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define AOI0_OUT3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 13) /* PIO1_25 */
#define DMA0_TRIG00_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG010_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG011_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG012_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG013_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG014_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG015_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG016_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG017_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG018_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG019_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG01_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG020_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG021_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG022_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG023_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG024_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG025_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG026_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG027_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG028_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG029_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG02_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG030_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG031_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG032_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG033_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG034_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG035_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG036_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG037_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG038_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG039_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG03_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG040_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG041_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG042_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG043_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG044_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG045_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG046_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG047_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG048_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG049_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG04_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG050_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG051_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG05_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG06_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG07_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG08_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA0_TRIG09_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG10_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG11_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG12_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG13_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG14_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG15_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG16_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG17_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG18_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA1_TRIG19_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define FC2_TXD_SCL_MISO_WS_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 1) /* PIO1_25 */
#define GPIO_PIO125_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT1_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT3_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT4_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT5_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT6_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT_PINT7_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PIO1_25_PIO1_25_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PWM1_A2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 11) /* PIO1_25 */
#define SCT0_OUT2_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 2) /* PIO1_25 */
#define SPI_SCLK_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 12) /* PIO1_25 */
#define UTICK0_CAPTURE0_PIO1_25 IOCON_MUX(57, IOCON_TYPE_D, 4) /* PIO1_25 */
#define ADC0_TRIG0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC0_TRIG1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC0_TRIG2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC0_TRIG3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC1_TRIG0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC1_TRIG1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC1_TRIG2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define ADC1_TRIG3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define AOI1_OUT2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 13) /* PIO1_26 */
#define CTIMER0_CAPTURE0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER0_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER0_CAPTURE2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER0_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER1_CAPTURE0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER1_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER1_CAPTURE2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER1_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER2_CAPTURE0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER2_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER2_CAPTURE2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER2_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER3_CAPTURE0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER3_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER3_CAPTURE2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER3_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER4_CAPTURE0_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER4_CAPTURE1_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER4_CAPTURE2_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER4_CAPTURE3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CT_INP3_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA0_TRIG00_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG010_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG011_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG012_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG013_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG014_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG015_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG016_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG017_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG018_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG019_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG01_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG020_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG021_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG022_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG023_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG024_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG025_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG026_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG027_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG028_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG029_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG02_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG030_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG031_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG032_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG033_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG034_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG035_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG036_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG037_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG038_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG039_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG03_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG040_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG041_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG042_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG043_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG044_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG045_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG046_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG047_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG048_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG049_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG04_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG050_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG051_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG05_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG06_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA0_TRIG07_PIO1_26 IOCON_MUX(58, IOCON_TYPE_D, 0) /* PIO1_26 */
