zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S36JBD100-pinctrl.h
#define PWM1_EXTA3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 13) /* PIO1_29 */
#define SCT0_IN0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define ADC0_TRIG0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC0_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC0_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC0_TRIG3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC1_TRIG0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC1_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC1_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC1_TRIG3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define AOI1_OUT3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 12) /* PIO1_30 */
#define DMA0_TRIG00_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG010_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG011_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG012_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG013_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG014_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG015_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG016_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG017_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG018_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG019_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG01_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG020_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG021_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG022_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG023_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG024_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG025_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG026_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG027_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG028_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG029_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG02_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG030_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG031_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG032_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG033_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG034_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG035_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG036_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG037_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG038_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG039_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG03_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG040_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG041_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG042_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG043_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG044_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG045_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG046_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG047_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG048_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG049_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG04_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG050_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG051_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG05_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG06_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG07_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG08_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG09_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG10_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG11_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG12_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG13_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG14_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG15_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG16_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG17_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG18_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA1_TRIG19_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define FC7_TXD_SCL_MISO_WS_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 1) /* PIO1_30 */
#define GPIO_PIO130_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define HSCMP0_OUT_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 13) /* PIO1_30 */
#define PINT_PINT0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PIO1_30_PIO1_30_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PWM0_X3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 11) /* PIO1_30 */
#define QSPI_CS0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 10) /* PIO1_30 */
#define SCT0_IN0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define ADC0_TRIG0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC0_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC0_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC0_TRIG3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC1_TRIG0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC1_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC1_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC1_TRIG3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define AOI0_IN0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN10_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN11_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN12_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN13_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN14_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN8_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI0_IN9_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN10_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN11_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN12_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN13_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN14_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN8_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define AOI1_IN9_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define CTIMER0_MATCH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 3) /* PIO1_31 */
#define DMA0_TRIG00_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG010_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG011_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG012_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG013_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG014_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG015_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG016_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG017_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG018_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG019_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG01_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG020_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG021_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG022_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG023_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG024_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG025_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG026_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG027_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG028_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG029_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG02_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG030_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG031_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG032_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG033_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG034_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG035_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG036_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG037_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG038_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG039_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG03_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG040_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG041_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG042_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG043_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG044_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG045_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG046_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG047_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG048_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG049_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG04_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG050_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG051_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG05_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG06_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG07_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG08_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG09_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG10_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG11_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG12_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG13_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG14_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG16_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG17_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG18_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA1_TRIG19_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ENC0_PHASEA_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define ENC0_PHASEB_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define ENC1_PHASEA_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define ENC1_PHASEB_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define EXTTRIG_IN2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define GPIO_PIO131_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define MCLK_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 1) /* PIO1_31 */
#define PINT_PINT0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PIO1_31_PIO1_31_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PWM0_EXTA0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_EXTA1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_EXTA2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_EXTA3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_EXSYNC_TRG_CH0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_EXSYNC_TRG_CH1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_EXSYNC_TRG_CH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_EXSYNC_TRG_CH3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_FAULT_TRG_CH0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_FAULT_TRG_CH1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_FAULT_TRG_CH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM0_PWM_FAULT_TRG_CH3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_B2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 11) /* PIO1_31 */
#define PWM1_EXTA0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_EXTA1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_EXTA2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_EXTA3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_EXSYNC_TRG_CH0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_EXSYNC_TRG_CH1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_EXSYNC_TRG_CH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_EXSYNC_TRG_CH3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_FAULT_TRG_CH0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_FAULT_TRG_CH1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_FAULT_TRG_CH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define PWM1_PWM_FAULT_TRG_CH3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 13) /* PIO1_31 */
#define SCT0_OUT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 4) /* PIO1_31 */
#define USB0_VBUS_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 7) /* PIO1_31 */
#define ADC0_CH9A_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 0) /* PIO2_0 */
#define AOI0_OUT0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 12) /* PIO2_0 */
#define CTIMER0_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER0_CAPTURE1_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER0_CAPTURE2_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER0_CAPTURE3_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER1_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER1_CAPTURE1_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER1_CAPTURE2_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER1_CAPTURE3_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER2_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER2_CAPTURE1_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER2_CAPTURE2_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER2_CAPTURE3_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER3_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER3_CAPTURE1_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER3_CAPTURE2_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER3_CAPTURE3_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER4_CAPTURE0_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER4_CAPTURE1_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER4_CAPTURE2_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CTIMER4_CAPTURE3_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define CT_INP4_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 4) /* PIO2_0 */
#define FC0_RXD_SDA_MOSI_DATA_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 2) /* PIO2_0 */
#define GPIO_PIO20_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 0) /* PIO2_0 */
#define I3C0_PUR_PIO2_0 IOCON_MUX(64, IOCON_TYPE_D, 5) /* PIO2_0 */
#define AOI0_OUT2_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 12) /* PIO2_1 */
#define CTIMER1_MATCH0_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 4) /* PIO2_1 */
#define FC0_TXD_SCL_MISO_WS_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 2) /* PIO2_1 */
#define GPIO_PIO21_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 0) /* PIO2_1 */
#define I3C0_SDA_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 5) /* PIO2_1 */
#define OPAMP2_DP0_PIO2_1 IOCON_MUX(65, IOCON_TYPE_D, 0) /* PIO2_1 */

#endif
